{
  "id": "02f79919a0b194204f831a92eda995bf",
  "source_type": "article",
  "source_url": "https://nextjs.org/blog/security-update-2025-12-11",
  "title": "Next.js Security Update: December 11, 2025",
  "author": "Josh Story; Sebastian Markbåge",
  "publish_date": "2025-12-11T00:00:00",
  "raw_content": "---\ntitle: Next.js Security Update: December 11, 2025\nauthor: Josh Story; Sebastian Markbåge\nurl: https://nextjs.org/blog/security-update-2025-12-11\nhostname: nextjs.org\ndescription: Two additional vulnerabilities have been identified in React Server Components. Users should upgrade to patched versions immediately.\nsitename: Next.js Security Update: December 11, 2025\ndate: 2025-12-11\n---\nThursday, December 11th 2025\nNext.js Security Update: December 11, 2025\nPosted byTwo additional vulnerabilities have been identified in the React Server Components (RSC) protocol. These issues were discovered while security researchers examined the patches for React2Shell. Importantly, neither of these new issues allow for Remote Code Execution. The patch for React2Shell remains fully effective.\nThese vulnerabilities originate in the upstream React implementation (CVE-2025-55183, CVE-2025-55184). This advisory tracks the downstream impact on Next.js applications using the App Router. For full details, see the React blog post.\nAddendum: The initial fix for CVE-2025-55184 was incomplete. A complete fix has been issued under CVE-2025-67779. If you previously upgraded to one of the initially recommended versions, please upgrade again to the latest patched versions listed below.\nImpact\nDenial of Service: CVE-2025-55184 (High Severity)\nA specifically crafted HTTP request can be sent to any App Router endpoint that, when deserialized, can cause an infinite loop that hangs the server process and prevents future HTTP requests from being served.\nNote: The initial fix for this vulnerability was incomplete. A complete fix has been issued under CVE-2025-67779. Users who previously upgraded must upgrade again to the latest patched versions.\nSource Code Exposure: CVE-2025-55183 (Medium Severity)\nA specifically crafted HTTP request can cause a Server Function to return the compiled source code of other Server Functions in your application. This could reveal business logic. Secrets could also be exposed if they are defined directly in your code (rather than accessed via environment variables at runtime) and referenced within a Server Function. Depending on your bundler configuration, these values may be inlined into the compiled function output.\nAffected and Fixed Next.js Versions\nApplications using React Server Components with the App Router are affected. The table below shows which versions are affected by each vulnerability and the corresponding fix:\nPages Router applications are not affected, but we still recommend upgrading to a patched version.\nRequired Action\nAll users should upgrade to the latest patched version in their release line:\nIf you are on Next.js >=13.3, 14.0.x, or 14.1.x, upgrade to the latest 14.2.x release.\nnpm install next@14.2.35 # for 14.x\nnpm install next@15.0.7 # for 15.0.x\nnpm install next@15.1.11 # for 15.1.x\nnpm install next@15.2.8 # for 15.2.x\nnpm install next@15.3.8 # for 15.3.x\nnpm install next@15.4.10 # for 15.4.x\nnpm install next@15.5.9 # for 15.5.x\nnpm install next@16.0.10 # for 16.0.x\nnpm install next@15.6.0-canary.60 # for 15.x canary releases\nnpm install next@16.1.0-canary.19 # for 16.x canary releases\nRun npx fix-react2shell-next\nto launch an interactive tool which can check versions and perform deterministic version bumps per the recommended versions above. See the GitHub repository for full details.\nnpx fix-react2shell-next\nThere is no workaround. Upgrading to a patched version is required.\nResources\n- CVE-2025-67779 (Complete DoS Fix): CVE, Next.js\n- CVE-2025-55184 (DoS): React, Next.js\n- CVE-2025-55183 (Source Code Exposure): React, Next.js\n- React blog: Denial of Service and Source Code Exposure in React Server Components\n- Previous Security Advisory: CVE-2025-66478\nDiscovery\nThank you to RyotaK from GMO Flatt Security Inc. and Andrew MacPherson for discovering and responsibly disclosing these vulnerabilities. We are intentionally limiting technical detail in this advisory to protect developers who have not yet upgraded.",
  "metadata": {
    "site": "Next.js Security Update: December 11, 2025"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:06:52.504209",
  "updated_at": "2026-01-24T09:06:52.504209"
}