{
  "id": "0348635f0ea31a2855f4d9c3c4e4131d",
  "source_type": "article",
  "source_url": "https://nextjs.org/blog/CVE-2025-66478",
  "title": "Security Advisory: CVE-2025-66478",
  "author": "Josh Story; Sebastian Markbåge",
  "publish_date": "2025-12-03T00:00:00",
  "raw_content": "---\ntitle: Security Advisory: CVE-2025-66478\nauthor: Josh Story; Sebastian Markbåge\nurl: https://nextjs.org/blog/CVE-2025-66478\nhostname: nextjs.org\ndescription: A critical vulnerability (CVE-2025-66478) has been identified in the React Server Components protocol. Users should upgrade to patched versions immediately.\nsitename: Next.js\ndate: 2025-12-03\n---\nWednesday, December 3rd 2025\nSecurity Advisory: CVE-2025-66478\nPosted byDecember 06, 9:05 PM PST: If your application was online and unpatched as of December 4th, 2025 at 1:00 PM PT, we strongly encourage you to rotate any secrets it uses, starting with your most critical ones.\nDecember 06, 7:29 AM PST: An npm package has been released to update affected Next.js apps. Use\nnpx fix-react2shell-next\nto update now, or visit the GitHub repository to learn more.\nA critical vulnerability has been identified in the React Server Components (RSC) protocol. The issue is rated CVSS 10.0 and can allow remote code execution when processing attacker-controlled requests in unpatched environments.\nThis vulnerability originates in the upstream React implementation (CVE-2025-55182). This advisory (CVE-2025-66478) tracks the downstream impact on Next.js applications using the App Router.\nImpact\nThe vulnerable RSC protocol allowed untrusted inputs to influence server-side execution behavior. Under specific conditions, an attacker could craft requests that trigger unintended server execution paths. This can result in remote code execution in unpatched environments.\nAll users should upgrade to a patched version immediately. See the required action section for specific instructions.\nAffected Next.js Versions\nApplications using React Server Components with the App Router are affected when running:\n- Next.js 15.x\n- Next.js 16.x\n- Next.js 14.3.0-canary.77 and later canary releases\nNext.js 13.x, Next.js 14.x stable, Pages Router applications, and the Edge Runtime are not affected.\nFixed Versions\nThe vulnerability is fully resolved in the following patched Next.js releases:\n- 15.0.5\n- 15.1.9\n- 15.2.6\n- 15.3.6\n- 15.4.8\n- 15.5.7\n- 16.0.7\nWe also released patched canary releases for Next.js 15 and 16:\n- 15.6.0-canary.58 (for 15.x canary releases)\n- 16.1.0-canary.12 (for 16.x canary releases)\nThese versions include the hardened React Server Components implementation.\nRequired Action\nAll users should upgrade to the latest patched version in their release line:\nnpm install next@15.0.5 # for 15.0.x\nnpm install next@15.1.9 # for 15.1.x\nnpm install next@15.2.6 # for 15.2.x\nnpm install next@15.3.6 # for 15.3.x\nnpm install next@15.4.8 # for 15.4.x\nnpm install next@15.5.7 # for 15.5.x\nnpm install next@16.0.7 # for 16.0.x\nnpm install next@15.6.0-canary.58 # for 15.x canary releases\nnpm install next@16.1.0-canary.12 # for 16.x canary releases\nIf you are on Next.js 14.3.0-canary.77 or a later canary release, downgrade to the latest stable 14.x release:\nnpm install next@14\nIf you're currently using canary releases to enable PPR, you can update to 15.6.0-canary.58, which includes a fix for the vulnerability while continuing to support PPR. For other ways to patch older versions, see this discussion post.\nRun npx fix-react2shell-next\nto launch an interactive tool which can check versions and perform deterministic version bumps per the recommended versions above. See the GitHub repository for full details.\nnpx fix-react2shell-next\nThere is no workaround—upgrading to a patched version is required.\nRotating environment variables\nOnce you have patched your version and re-deployed your application, we recommend rotating all your application secrets. Learn about working with environment variables in the documentation here.\nResources\n- Security advisories: React (CVE-2025-55182), Next.js (CVE-2025-66478)\n- React blog: Critical Security Vulnerability in React Server Components\n- Vercel Knowledge Base: React2Shell Security Bulletin\n- Netlify Blog: Netlify's response to the critical React security vulnerability\n- AWS Security Blog: China-nexus cyber threat groups rapidly exploit React2Shell vulnerability\n- Google Cloud Blog: Responding to CVE-2025-55182: Secure your React and Next.js workloads\n- Fastly Blog: Fastly's Proactive Protection for React2Shell, Critical React RCE CVE-2025-55182 and CVE-2025-66478\n- Akamai Blog: CVE-2025-55182: React and Next.js Server Functions Deserialization RCE\nDiscovery\nThank you to Lachlan Davidson for discovering and responsibly disclosing this vulnerability. We are intentionally limiting technical detail in this advisory to protect developers who have not yet upgraded.",
  "metadata": {
    "site": "Next.js"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:06:52.768440",
  "updated_at": "2026-01-24T09:06:52.768440"
}