{
  "id": "07014cd4821efb27d15133d54ae5dd3a",
  "source_type": "article",
  "source_url": "https://techcrunch.com/2026/01/23/legal-ai-giant-harvey-acquires-hexus-as-competition-heats-up-in-legal-tech/",
  "title": "Legal AI giant Harvey acquires Hexus as competition heats up in legal tech | TechCrunch",
  "author": "Connie Loizos",
  "publish_date": "2026-01-23T00:00:00",
  "raw_content": "---\ntitle: Legal AI giant Harvey acquires Hexus as competition heats up in legal tech | TechCrunch\nauthor: Connie Loizos\nurl: https://techcrunch.com/2026/01/23/legal-ai-giant-harvey-acquires-hexus-as-competition-heats-up-in-legal-tech/\nhostname: techcrunch.com\ndescription: Hexus founder and CEO Sakshi Pratap, who previously held engineering roles at Walmart, Oracle, and Google, tells TechCrunch that her San Francisco-based team has already joined Harvey, while the startup's India-based engineers will come onboard once Harvey establishes a Bangalore office.\nsitename: TechCrunch\ndate: 2026-01-23\ncategories: ['AI', 'TC']\n---\nHarvey, the high-flying legal AI startup, has acquired Hexus — a two-year-old startup that builds tools for creating product demos, videos, and guides — as the company continues its aggressive expansion amid fierce competition in the legal tech market.\nHexus founder and CEO Sakshi Pratap, who previously held engineering roles at Walmart, Oracle, and Google, tells TechCrunch that her San Francisco-based team has already joined Harvey, while the startup’s India-based engineers will come onboard once Harvey establishes a Bangalore office. Pratap adds that she will lead an engineering team focused on accelerating Harvey’s offerings for in-house legal departments.\n“What we’re bringing to Harvey is deep experience building enterprise AI tools in adjacent problem spaces,” Pratap said. “This expertise helps Harvey move faster in a market that’s becoming increasingly competitive.”\nHexus had raised $1.6 million from Pear VC, Liquid 2 Ventures, and angel investors before the acquisition. While Pratap declined to share deal terms, she said the structure was aligned around “long-term team incentives.”\nThe acquisition comes as Harvey looks to cement its position as one of AI’s hottest startups. The company confirmed last fall that it’s now valued at $8 billion after raising $160 million, bringing its funding across 2025 to $760 million. Andreessen Horowitz led that newest round, joined by new investors T. Rowe Price and WndrCo, alongside existing backers Sequoia Capital, Kleiner Perkins, Conviction, and angel investor Elad Gil. (It started the year with a $3 billion valuation after Sequoia led a $300 million Series D round in the company.)\nHarvey now claims more than 1,000 clients across 60 countries, including a majority of the top 10 U.S. law firms.\nWhen TechCrunch spoke with co-founder and CEO Winston Weinberg in November, he traced Harvey’s origin story back to a cold email sent to OpenAI CEO Sam Altman. Weinberg, then a first-year associate at O’Melveny & Myers, and co-founder Gabe Pereyra, a researcher who worked at Google DeepMind and Meta and was Weinberg’s roommate at the time, tested GPT-3 on landlord-tenant law questions from Reddit. When they showed the AI-generated answers to attorneys, two out of three said they’d send 86 of 100 responses with zero edits.\nDisrupt 2026 Tickets: One-time offer\nTickets are live! Save up to $680 while these rates last, and be among the first 500 registrants to get 50% off your +1 pass. TechCrunch Disrupt brings top leaders from Google Cloud, Netflix, Microsoft, Box, a16z, Hugging Face, and more to 250+ sessions designed to fuel growth and sharpen your edge. Connect with hundreds of innovative startups and join curated networking that drives deals, insights, and inspiration.\nDisrupt 2026 Tickets: One-time offer\nTickets are live! Save up to $680 while these rates last, and be among the first 500 registrants to get 50% off your +1 pass. TechCrunch Disrupt brings top leaders from Google Cloud, Netflix, Microsoft, Box, a16z, Hugging Face, and more to 250+ sessions designed to fuel growth and sharpen your edge. Connect with hundreds of innovative startups and join curated networking that drives deals, insights, and inspiration.\n“That was the moment when we were like, wow, this entire industry can be transformed by this technology,” Weinberg said.\nThey emailed Altman on July 4, 2022, got on a call that same morning, and landed their first check from the OpenAI Startup Fund shortly after. According to Weinberg, the OpenAI Startup Fund remains Harvey’s second-largest investor.",
  "metadata": {
    "site": "TechCrunch"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:07:33.243042",
  "updated_at": "2026-01-24T09:07:33.243042"
}