{
  "id": "1c3efbc3d0f397690f41836697e2fe9e",
  "source_type": "article",
  "source_url": "https://blog.google/products-and-platforms/products/education/our-life-with-ai-2025/",
  "title": "Learners and educators are AI’s new “super users”",
  "author": "Ben Gomes",
  "publish_date": "2026-01-15T00:00:00",
  "raw_content": "---\ntitle: Learners and educators are AI’s new “super users”\nauthor: Ben Gomes\nurl: https://blog.google/products-and-platforms/products/education/our-life-with-ai-2025/\nhostname: blog.google\ndescription: Google’s 2025 Our Life with AI survey found people are using AI tools to learn new things.\nsitename: Google\ndate: 2026-01-15\ntags: ['None', 'Learning & Education,AI']\n---\nLearners and educators are AI’s new “super users”\nFor the past three years, we’ve conducted the “Our Life with AI” study with Ipsos to measure how people around the world use AI. Our most recent survey found something fascinating: for the first time, the top motivation for using AI is learning.\nThe survey, conducted late last year across 21 countries and 21,000 participants, reveals two firsts: that the majority of people in nearly every country surveyed say they use AI chatbots and, critically, that their motivation for using AI changed from curiosity to core utility.\nBefore this year, the top motivation for using AI was entertainment, but now 74% of users report using it to “learn something new” or “understand a complex topic.” People are moving from experimentation to real-world learning, and view AI for education with a different perspective. Here’s a look at what our survey found.\nStudents, teachers and parents are using AI\n- 85% of students 18+ are using AI. Students use it to help with schoolwork (83%), understand complex topics (78%), manage day-to-day life tasks like trips, meals or workouts (54%) and make decisions (42%).\n- 81% of teachers report using AI, far surpassing the global average (66% of the global public reports using an AI tool). Some of educators’ top uses for AI are learning something new or understanding a complex topic (77% of teacher users) and saving time (75%). We observed the time-saving potential of AI first-hand during a six-month pilot program in Northern Ireland where teachers reported saving an average of 10 hours per week with the help of Gemini.\n- 76% of parents say they use AI, especially to learn something new (77%) or to assist with work (73%). Nearly half (49%) of parents report using AI to explore changing careers, making more money or starting a new business.\n- Most importantly, rather than fearing cognitive decline, teachers, students (18+) and parents believe AI is having a positive impact on how we learn. A majority of teachers also believe AI will improve teaching quality (67%) and student outcomes (63%).\nOutside of the United States, Canada and Europe, the global public echoes student and teachers’ positive attitudes about AI for education:\n- In emerging markets, people believe AI is more likely to improve student outcomes by supporting personalized learning (63%) than worsen student outcomes by eroding critical thinking (37%).\n- In South Korea, Japan and Singapore — where students scored strong 500+ PISA scores (a globally recognized benchmark for 15-year-olds' real-world skills in reading, math and science) — attitudes are equally positive about AI’s role in education (63% improve, 37% worsen).\nGoogle’s tools are transforming learning using AI\nAI is changing how we learn, but, as the survey shows, the situation is complex. With increasing usage, it’s more important than ever that we continue to build AI tools with appropriate guardrails. Another study in Europe similarly found that students are seeking guidance on how to use these tools – and it’s up to all of us to ensure we match that need with appropriate safeguards for younger users. Simultaneously, we are mindful of the \"5% problem\": the risk that these benefits only reach the most privileged or those most motivated to learn. According to the survey, the public expects tech companies and governments to work together to ensure these tools serve the public interest.\nOur \"North Star\" for AI in education is to improve learning outcomes for everyone and help teachers focus on teaching, so they can maintain the human connection at the heart of learning. Our tools like Gemini’s Guided Learning Mode, Gemini for Education, Google AI Pro for Education and NotebookLM are helping transform learning by supporting personalized instruction and easing administrative burdens. By grounding our products in learning science and deep partnership with educators, students and experts, we’re committed to innovating responsibly so that AI helps every person reach their full potential.",
  "metadata": {
    "site": "Google"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:07:35.239906",
  "updated_at": "2026-01-24T09:07:35.239906"
}