{
  "id": "319ee5aa6adee410588cef0155fb4db3",
  "source_type": "article",
  "source_url": "https://blog.google/products-and-platforms/products/search/personal-intelligence-ai-mode-search/",
  "title": "Personal Intelligence in AI Mode in Search: Help that's uniquely yours",
  "author": "Robby Stein",
  "publish_date": "2026-01-22T00:00:00",
  "raw_content": "---\ntitle: Personal Intelligence in AI Mode in Search: Help that's uniquely yours\nauthor: Robby Stein\nurl: https://blog.google/products-and-platforms/products/search/personal-intelligence-ai-mode-search/\nhostname: blog.google\ndescription: Personal Intelligence lets you tap into your context from Gmail and Photos to deliver tailored responses in Search, just for you.\nsitename: Google\ndate: 2026-01-22\ntags: ['None', 'Search,AI']\n---\nPersonal Intelligence in AI Mode in Search: Help that's uniquely yours\nWith Google Search, you should be able to ask any question and find precisely what you need. Accessing the world’s information is the foundation, but the most helpful search experience brings together that global knowledge with insights that are uniquely relevant to you. To make this vision possible, today we’re expanding Personal Intelligence to AI Mode in Google Search.\nPersonal Intelligence transforms Search into an experience that feels uniquely yours by connecting the dots across your Google apps. Starting today, Google AI Pro and AI Ultra subscribers can opt-in to securely connect Gmail and Google Photos to AI Mode. With this new experience, you can tap into your own personal context and insights to unlock even more helpful Search responses that are tailored to you.\nGet a more tailored Search, just for you\nWith Personal Intelligence, recommendations don’t just match your interests — they fit seamlessly into your life. You don’t have to constantly explain your preferences or existing plans, it selects recommendations just for you, right from the start.\nIn testing Personal Intelligence with Gmail and Google Photos enabled, I’ve found new things that I wouldn’t have ever considered or discovered before. One recent example: I was looking for a new pair of sneakers, and AI Mode noticed a brand I’d just bought and suggested a new style I hadn’t seen yet. The recommendation was spot on — I bought them instantly!\nHere are a few more examples where Personal Intelligence in Search can be helpful for you:\nSay you’re looking for things to do and places to eat that the whole family would enjoy ahead of your upcoming getaway. With Personal Intelligence, AI Mode can reference your hotel booking in Gmail and travel memories in Google Photos, to suggest an itinerary with something for everyone. You’ll see tailored recommendations like an interactive museum perfect for the kids or an old-timey ice cream parlor, because it recalls the many ice-cream selfies captured in your pictures. It’s not just a generic list of restaurants and activities; it’s a personalized starting point for your next great weekend.\nPersonal Intelligence can also be particularly helpful for shopping, because AI Mode considers the types of items you buy and where you shop. If you need a new coat for your upcoming trip, AI Mode could automatically take into account the brands you prefer, as well as your flight confirmation in Gmail to identify the destination and timing (Chicago in March). You’ll get suggestions for windproof, versatile coats that fit the weather and your preferred look. It’s like a personal shopper who already knows your itinerary and the vibe you’re going for.\nYou can even ask fun questions that you never imagined searching for — like “if my life were a movie, what would the title and movie genre be,” or “describe my perfect day.”\nYou’re always in control\nWe’ve designed Personal Intelligence with transparency, choice and control at its core. Connecting your Gmail and Google Photos is strictly opt-in, meaning you choose if and when you want to connect these apps to Search and you can always turn those connections on or off. Built with privacy in mind, AI Mode uses our most intelligent model, Gemini 3, and doesn’t train directly on your Gmail inbox or Google Photos library. Training is contained to limited info, like specific prompts in AI Mode and the model’s responses, to improve functionality over time. Learn more here.\nIn our internal testing, we know that Personal Intelligence in Search can be incredibly helpful, but mistakes can happen. Our systems might incorrectly make connections between unrelated topics or not fully understand the context. If a recommendation feels a bit off, you can correct it and clarify what you were looking for with a follow-up response in AI Mode. You can also provide feedback by giving the response a “thumbs down.” Learn more about our approach and how we’re addressing limitations here.\nThe ability to connect AI Mode to your Gmail and Google Photos is rolling out as a Labs feature. Eligible Google AI Pro and Ultra subscribers in English in the U.S. will automatically have access to the feature as it becomes available. This experimental feature is available for personal Google accounts and not for Workspace business, enterprise or education users.\nAs this rolls out over the next few days, AI Pro and Ultra subscribers should see an invitation to try this experience out in AI Mode, but if not, you can also turn it on in your settings, simply:\n- Open Search and tap your profile\n- Click on Search personalization\n- Select Connected Content Apps\n- Connect Workspace and Google Photos\nWe’re looking forward to hearing how you make Search your own.",
  "metadata": {
    "site": "Google"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:07:34.577804",
  "updated_at": "2026-01-24T09:07:34.577804"
}