{
  "id": "633a2fe28ce5f23b54f5a55fa20d046e",
  "source_type": "article",
  "source_url": "https://techcrunch.com/2026/01/23/google-photos-latest-feature-lets-you-meme-yourself/",
  "title": "Google Photos' latest feature lets you meme yourself | TechCrunch",
  "author": "Sarah Perez",
  "publish_date": "2026-01-23T00:00:00",
  "raw_content": "---\ntitle: Google Photos' latest feature lets you meme yourself | TechCrunch\nauthor: Sarah Perez\nurl: https://techcrunch.com/2026/01/23/google-photos-latest-feature-lets-you-meme-yourself/\nhostname: techcrunch.com\ndescription: The addition is meant to just be a fun way to explore your photos and experiment with Google's Gemini AI technology, and specifically Nano Banana.\nsitename: TechCrunch\ndate: 2026-01-23\ncategories: ['AI', 'Apps']\ntags: ['google,google photos,memes,ai']\n---\nGoogle Photos will now let you make memes with your own images. On Thursday, Google introduced a new generative AI-powered feature called “Me Meme,” which will allow you to combine a photo template and an image of yourself to generate an image of the meme.\nThe new feature, which will be first available to U.S.-based users, was originally spotted in development last October by the blog Android Authority. It was formally announced by Google via its Photos Community site on Thursday.\nAccording to Google, the feature is experimental, so generated images “may not perfectly match the original photo.” It suggests uploading well-lit, focused, and front-facing photos to get the best results.\nThe addition is meant to just be a fun way to explore your photos and experiment with Google’s Gemini AI technology, and specifically Nano Banana. Google’s popular AI image model powers other AI features in the Google Photos app, like the ability to re-create images in new styles, such as cartoons or paintings.\nThough a fairly unserious addition, all things considered, these types of features help remind users to return to the Photos app whenever they want to play around with AI tools, rather than going to a competitor’s product.\nPlus, users tend to gravitate toward features that show themselves in AI edits, as OpenAI found with its successful launch of the Sora app, which lets you make AI videos that can include yourself and your friends.\n“Me Meme” isn’t fully rolled out, so you may not see it in your updated Google Photos app just yet. When available, it will appear under the “Create” tab, Google says. A rep for Google told TechCrunch the feature will reach U.S. iOS and Android users over the “coming weeks.”\nDisrupt 2026 Tickets: One-time offer\nTickets are live! Save up to $680 while these rates last, and be among the first 500 registrants to get 50% off your +1 pass. TechCrunch Disrupt brings top leaders from Google Cloud, Netflix, Microsoft, Box, a16z, Hugging Face, and more to 250+ sessions designed to fuel growth and sharpen your edge. Connect with hundreds of innovative startups and join curated networking that drives deals, insights, and inspiration.\nDisrupt 2026 Tickets: One-time offer\nTickets are live! Save up to $680 while these rates last, and be among the first 500 registrants to get 50% off your +1 pass. TechCrunch Disrupt brings top leaders from Google Cloud, Netflix, Microsoft, Box, a16z, Hugging Face, and more to 250+ sessions designed to fuel growth and sharpen your edge. Connect with hundreds of innovative startups and join curated networking that drives deals, insights, and inspiration.\nTo use the feature, you’ll select a template or upload your own, then tap “add photo” and “Generate.” Google notes that more templates are being added over time. After the AI creates the image, you can save the photo, share it on other platforms, or tap “regenerate” to have it re-imagine the image a second time.",
  "metadata": {
    "site": "TechCrunch"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:07:33.428923",
  "updated_at": "2026-01-24T09:07:33.428923"
}