{
  "id": "6e049a731de9fe14d14bec5bf1077f6b",
  "source_type": "article",
  "source_url": "https://nextjs.org/blog/next-16",
  "title": "Next.js 16",
  "author": "Jimmy Lai; Josh Story; Sebastian Markbåge; Tim Neutkens",
  "publish_date": "2025-10-21T00:00:00",
  "raw_content": "---\ntitle: Next.js 16\nauthor: Jimmy Lai; Josh Story; Sebastian Markbåge; Tim Neutkens\nurl: https://nextjs.org/blog/next-16\nhostname: nextjs.org\ndescription: Next.js 16 includes Cache Components, stable Turbopack, file system caching, React Compiler support, smarter routing, new caching APIs, and React 19.2 features.\nsitename: Next.js 16\ndate: 2025-10-21\n---\nTuesday, October 21st 2025\nNext.js 16\nPosted byAhead of our upcoming Next.js Conf 2025, Next.js 16 is now available.\nThis release provides the latest improvements to Turbopack, caching, and the Next.js architecture. Since the previous beta release, we added several new features and improvements:\n- Cache Components: New model using Partial Pre-Rendering (PPR) and use cache for instant navigation.\n- Next.js Devtools MCP: Model Context Protocol integration for improved debugging and workflow.\n- Proxy: Middleware replaced by\nproxy.ts\nto clarify network boundary. - DX: Improved logging for builds and development requests.\nFor reminder, those features were available since the previous beta release:\n- Turbopack (stable): Default bundler for all apps with up to 5-10x faster Fast Refresh, and 2-5x faster builds\n- Turbopack File System Caching (beta): Even faster startup and compile times for the largest apps\n- React Compiler Support (stable): Built-in integration for automatic memoization\n- Build Adapters API (alpha): Create custom adapters to modify the build process\n- Enhanced Routing: Optimized navigations and prefetching with layout deduplication and incremental prefetching\n- Improved Caching APIs: New\nupdateTag()\nand refinedrevalidateTag()\n- React 19.2: View Transitions,\nuseEffectEvent()\n,<Activity/>\n- Breaking Changes: Async params,\nnext/image\ndefaults, and more\nUpgrade to Next.js 16:\n# Use the automated upgrade CLI\nnpx @next/codemod@canary upgrade latest\n# ...or upgrade manually\nnpm install next@latest react@latest react-dom@latest\n# ...or start a new project\nnpx create-next-app@latest\nFor cases where the codemod can't fully migrate your code, please read the upgrade guide.\nNew Features and Improvements\nCache Components\nCache Components are a new set of features designed to make caching in Next.js both more explicit, and more flexible. They center around the new \"use cache\"\ndirective, which can be used to cache pages, components, and functions, and which leverages the compiler to automatically generate cache keys wherever it’s used.\nUnlike the implicit caching found in previous versions of the App Router, caching with Cache Components is entirely opt-in. All dynamic code in any page, layout, or API route is executed at request time by default, giving Next.js an out-of-the-box experience that’s better aligned with what developers expect from a full-stack application framework.\nCache Components also complete the story of Partial Prerendering (PPR), which was first introduced in 2023. Prior to PPR, Next.js had to choose whether to render each URL statically or dynamically; there was no middle ground. PPR eliminated this dichotomy, and let developers opt portions of their static pages into dynamic rendering (via Suspense) without sacrificing the fast initial load of fully static pages.\nYou can enable Cache Components in your next.config.ts\nfile:\nconst nextConfig = {\ncacheComponents: true,\n};\nexport default nextConfig;\nWe will be sharing more about Cache Components and how to use them at Next.js Conf 2025 on October 22nd, and we will be sharing more content in our blog and documentation in the coming weeks.\nNote: as previously announced in the beta release, the previous experimental\nexperimental.ppr\nflag and configuration options have been removed in favor of the Cache Components configuration.\nLearn more in the documentation here.\nNext.js Devtools MCP\nNext.js 16 introduces Next.js DevTools MCP, a Model Context Protocol integration for AI-assisted debugging with contextual insight into your application.\nThe Next.js DevTools MCP provides AI agents with:\n- Next.js knowledge: Routing, caching, and rendering behavior\n- Unified logs: Browser and server logs without switching contexts\n- Automatic error access: Detailed stack traces without manual copying\n- Page awareness: Contextual understanding of the active route\nThis enables AI agents to diagnose issues, explain behavior, and suggest fixes directly within your development workflow.\nLearn more in the documentation here.\nproxy.ts\n(formerly middleware.ts\n)\nproxy.ts\nreplaces middleware.ts\nand makes the app’s network boundary explicit. proxy.ts\nruns on the Node.js runtime.\n- What to do: Rename\nmiddleware.ts\n→proxy.ts\nand rename the exported function toproxy\n. Logic stays the same. - Why: Clearer naming and a single, predictable runtime for request interception.\nexport default function proxy(request: NextRequest) {\nreturn NextResponse.redirect(new URL('/home', request.url));\n}\nNote: The\nmiddleware.ts\nfile is still available for Edge runtime use cases, but it is deprecated and will be removed in a future version.\nLearn more in the documentation here.\nLogging Improvements\nIn Next.js 16 the development request logs are extended showing where time is spent.\n- Compile: Routing and compilation\n- Render: Running your code and React rendering\nThe build is also extended to show where time is spent. Each step in the build process is now shown with the time it took to complete.\n▲ Next.js 16 (Turbopack)\n✓ Compiled successfully in 615ms\n✓ Finished TypeScript in 1114ms\n✓ Collecting page data in 208ms\n✓ Generating static pages in 239ms\n✓ Finalizing page optimization in 5ms\nThe following features were previously announced in the beta release:\nDeveloper Experience\nTurbopack (stable)\nTurbopack has reached stability for both development and production builds, and is now the default bundler for all new Next.js projects. Since its beta release earlier this summer, adoption has scaled rapidly: more than 50% of development sessions and 20% of production builds on Next.js 15.3+ are already running on Turbopack.\nWith Turbopack, you can expect:\n- 2–5× faster production builds\n- Up to 10× faster Fast Refresh\nWe're making Turbopack the default to bring these performance gains to every Next.js developer, no configuration required. For apps with custom webpack setups, you can continue using webpack by running:\nnext dev --webpack\nnext build --webpack\nTurbopack File System Caching (beta)\nTurbopack now supports filesystem caching in development, storing compiler artifacts on disk between runs for significantly faster compile times across restarts, especially in large projects.\nEnable filesystem caching in your configuration:\nconst nextConfig = {\nexperimental: {\nturbopackFileSystemCacheForDev: true,\n},\n};\nexport default nextConfig;\nAll internal Vercel apps are already using this feature, and we’ve seen notable improvements in developer productivity across large repositories.\nWe’d love to hear your feedback as we iterate on filesystem caching. Please try it out and share your experience.\nSimplified create-next-app\ncreate-next-app\nhas been redesigned with a simplified setup flow, updated project structure, and improved defaults. The new template includes the App Router by default, TypeScript-first configuration, Tailwind CSS, and ESLint.\nBuild Adapters API (alpha)\nFollowing the Build Adapters RFC, we've worked with the community and deployment platforms to deliver the first alpha version of the Build Adapters API.\nBuild Adapters allow you to create custom adapters that hook into the build process, enabling deployment platforms and custom build integrations to modify Next.js configuration or process build output.\nconst nextConfig = {\nexperimental: {\nadapterPath: require.resolve('./my-adapter.js'),\n},\n};\nmodule.exports = nextConfig;\nShare your feedback in the RFC discussion.\nReact Compiler Support (stable)\nBuilt-in support for the React Compiler is now stable in Next.js 16 following the React Compiler's 1.0 release. The React Compiler automatically memoizes components, reducing unnecessary re-renders with zero manual code changes.\nThe reactCompiler\nconfiguration option has been promoted from experimental\nto stable. It is not enabled by default as we continue gathering build performance data across different application types. Expect compile times in development and during builds to be higher when enabling this option as the React Compiler relies on Babel.\nconst nextConfig = {\nreactCompiler: true,\n};\nexport default nextConfig;\nInstall the latest version of the React Compiler plugin:\nnpm install babel-plugin-react-compiler@latest\nCore Features & Architecture\nEnhanced Routing and Navigation\nNext.js 16 includes a complete overhaul of the routing and navigation system, making page transitions leaner and faster.\nLayout deduplication: When prefetching multiple URLs with a shared layout, the layout is downloaded once instead of separately for each Link. For example, a page with 50 product links now downloads the shared layout once instead of 50 times, dramatically reducing the network transfer size.\nIncremental prefetching: Next.js only prefetches parts not already in cache, rather than entire pages. The prefetch cache now:\n- Cancels requests when the link leaves the viewport\n- Prioritizes link prefetching on hover or when re-entering the viewport\n- Re-prefetches links when their data is invalidated\n- Works seamlessly with upcoming features like Cache Components\nTrade-off: You may see more individual prefetch requests, but with much lower total transfer sizes. We believe this is the right trade-off for nearly all applications. If the increased request count causes issues, please let us know. We're working on additional optimizations to inline data chunks more efficiently.\nThese changes require no code modifications and are designed to improve performance across all apps.\nImproved Caching APIs\nNext.js 16 introduces refined caching APIs for more explicit control over cache behavior.\nrevalidateTag()\n(updated)\nrevalidateTag()\nnow requires a cacheLife\nprofile as the second argument to enable stale-while-revalidate (SWR) behavior:\nimport { revalidateTag } from 'next/cache';\n// ✅ Use built-in cacheLife profile (we recommend 'max' for most cases)\nrevalidateTag('blog-posts', 'max');\n// Or use other built-in profiles\nrevalidateTag('news-feed', 'hours');\nrevalidateTag('analytics', 'days');\n// Or use an inline object with a custom revalidation time\nrevalidateTag('products', { expire: 3600 });\n// ⚠️ Deprecated - single argument form\nrevalidateTag('blog-posts');\nThe profile argument accepts built-in cacheLife\nprofile names (like 'max'\n, 'hours'\n, 'days'\n) or custom profiles defined in your next.config\n. You can also pass an inline { expire: number }\nobject. We recommend using 'max'\nfor most cases, as it enables background revalidation for long-lived content. When users request tagged content, they receive cached data immediately while Next.js revalidates in the background.\nUse revalidateTag()\nwhen you want to invalidate only properly tagged cached entries with stale-while-revalidate behavior. This is ideal for static content that can tolerate eventual consistency.\nMigration guidance: Add the second argument with a\ncacheLife\nprofile (we recommend'max'\n) for SWR behavior, or useupdateTag()\nin Server Actions if you need read-your-writes semantics.\nupdateTag()\n(new)\nupdateTag()\nis a new Server Actions-only API that provides read-your-writes semantics, expiring and immediately reading fresh data within the same request:\n'use server';\nimport { updateTag } from 'next/cache';\nexport async function updateUserProfile(userId: string, profile: Profile) {\nawait db.users.update(userId, profile);\n// Expire cache and refresh immediately - user sees their changes right away\nupdateTag(`user-${userId}`);\n}\nThis ensures interactive features reflect changes immediately. Perfect for forms, user settings, and any workflow where users expect to see their updates instantly.\nrefresh()\n(new)\nrefresh()\nis a new Server Actions-only API for refreshing uncached data only. It doesn't touch the cache at all:\n'use server';\nimport { refresh } from 'next/cache';\nexport async function markNotificationAsRead(notificationId: string) {\n// Update the notification in the database\nawait db.notifications.markAsRead(notificationId);\n// Refresh the notification count displayed in the header\n// (which is fetched separately and not cached)\nrefresh();\n}\nThis API is complementary to the client-side router.refresh()\n. Use it when you need to refresh uncached data displayed elsewhere on the page after performing an action. Your cached page shells and static content remain fast while dynamic data like notification counts, live metrics, or status indicators refresh.\nReact 19.2 and Canary Features\nThe App Router in Next.js 16 uses the latest React Canary release, which includes the newly released React 19.2 features and other features being incrementally stabilized. Highlights include:\n- View Transitions: Animate elements that update inside a Transition or navigation\nuseEffectEvent\n: Extract non-reactive logic from Effects into reusable Effect Event functions- Activity: Render \"background activity\" by hiding UI with\ndisplay: none\nwhile maintaining state and cleaning up Effects\nLearn more in the React 19.2 announcement.\nBreaking Changes and Other Updates\nVersion Requirements\nRemovals\nThese features were previously deprecated and are now removed:\nBehavior Changes\nThese features have new default behaviors in Next.js 16:\nDeprecations\nThese features are deprecated in Next.js 16 and will be removed in a future version:\nAdditional Improvements\n- Performance improvements: Significant performance optimizations for\nnext dev\nandnext start\ncommands - Node.js native TypeScript for\nnext.config.ts\n: Runnext dev\n,next build\n, andnext start\ncommands with--experimental-next-config-strip-types\nflag to enable native TypeScript fornext.config.ts\n.\nWe'll aim to share a more comprehensive migration guide ahead of the stable release in our documentation.\nFeedback and Community\nShare your feedback and help shape the future of Next.js:\nContributors\nNext.js is the result of the combined work of over 3,000 individual developers. This release was brought to you by:\n- The Next.js team: Andrew, Hendrik, Janka, Jiachi, Jimmy, Jiwon, JJ, Josh, Jude, Sam, Sebastian, Sebbie, Wyatt, and Zack.\n- The Turbopack team: Benjamin, Josh, Luke, Niklas, Tim, Tobias, and Will.\n- The Next.js Docs team: Delba, Rich, Ismael, and Joseph.\nHuge thanks to @mischnic, @timneutkens, @unstubbable, @wyattjoh, @Cy-Tek, @lukesandberg, @OoMNoO, @ztanner, @icyJoseph, @huozhi, @gnoff, @ijjk, @povilasv, @dwrth, @obendev, @aymericzip, @devjiwonchoi, @SyMind, @vercel-release-bot, @Shireee, @eps1lon, @dharun36, @kachkaev, @bgw, @yousefdawood7, @TheAlexLichter, @sokra, @ericx0099, @leerob, @Copilot, @fireairforce, @fufuShih, @anvibanga, @hayes, @Milancen123, @martinfrancois, @lubieowoce, @gaojude, @lachlanjc, @liketiger, @styfle, @aaronbrown-vercel, @Samii2383, @FelipeChicaiza, @kevva, @m1abdullahh, @F7b5, @Anshuman71, @RobertFent, @poteto, @chloe-yan, @sireesha-siri, @brian-lou, @joao4xz, @stefanprobst, @samselikoff, @acdlite, @gwkline, @bgub, @brock-statsig, and @karlhorky for helping!",
  "metadata": {
    "site": "Next.js 16"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:06:53.221099",
  "updated_at": "2026-01-24T09:06:53.221099"
}