{
  "id": "76d49254ac94549cf9a7fb40812e7310",
  "source_type": "article",
  "source_url": "https://www.sabrina.dev/p/10-year-old-vibe-codes-2-apps",
  "title": "10 Year Old Vibe Codes 2 Apps in 2 Hours (FULL Prompts + Tutorial)",
  "author": "Sabrina Ramonov",
  "publish_date": "2026-01-03T00:00:00",
  "raw_content": "---\ntitle: 10 Year Old Vibe Codes 2 Apps in 2 Hours (FULL Prompts + Tutorial)\nauthor: Sabrina Ramonov\nurl: https://www.sabrina.dev/p/10-year-old-vibe-codes-2-apps\nhostname: sabrina.dev\ndescription: Build your first app in 15 minutes with this step-by-step vibe coding tutorial for beginners!\nsitename: Sabrina Ramonov\ndate: 2026-01-03\n---\n10 Year Old Vibe Codes 2 Apps in 2 Hours (FULL Prompts + Tutorial)\nBuild your first app in 15 minutes with this step-by-step vibe coding tutorial for beginners!\nMost people think if they want to build an app, they need a 4-year computer science degree, $100k in tuition, and 10+ years of debugging syntax errors.\nThey think the “software gold rush” is over because the barrier to entry is just too high.\nBut the truth is, coding just changed forever.\nWe’ve entered the era of Vibe Coding… where the main thing standing between YOU and a functional app is the ability to describe your vision in plain language.\nTo prove it, I sat my 10-year-old niece down in front of a laptop last night after my AI Livestream.\nShe has zero tech experience.\nShe’s never taken a coding class.\nShe has no idea what “vibe coding” means.\nMost importantly, she had NO FEAR because I framed it as a new fun thing to play with.\nIn 2 hours, she vibe-coded for the 1st time ever… and now has 2 working apps.\nToday, I’m going to show you the exact tool and prompts she used, why the old way of learning to code is dead, and exactly how to vibe code your first app in 10 minutes.\nWatch my Youtube for the visual tutorial:\nTo support my free AI education: HIT LIKE + LEAVE A COMMENT🙏\nWhat is Vibe Coding?\nVibe Coding shifts your focus from the mechanics to the meaning behind your product.\nInstead of being a writer, laboring over every word and punctuation mark, you are now the DIRECTOR, obsessing over every frame, emotion, and moment in your story (i.e. user experience).\nInstead of manually typing every line of code, you describe what you want in plain English. AI interprets your intent to generate code in just a few minutes.\nYou aren’t doing less work… you’re doing higher-level work.\nIt’s a powerful abstraction layer, lowering the barrier to entry. I talk about the different stages of vibe coding and tools here.\nBut the important thing:\nIf you are NOT technical, vibe coding empowers you to build SIMPLE websites, apps, and products. But it still takes a lot of work, debugging, and technical know-how to build more complex products - you can certainly learn this too, but be realistic in timelines. Expect months, not days.\nHow Do You Vibe Code?\nMy #1 advice is to simplify your app to ONE sentence.\nWhat is the ONE thing your app does that is useful?\nYour first app should not be a CRM with 20 features.\nMake sure your first version with ONE feature works, test aggressively, then add ONE more sentence (i.e. feature), and test that works before adding anything else.\nWhile vibe coding is powerful, it’s still often wrong and brittle, so you need to build incrementally, slowly. Think training wheels.\nTo start, sign up for this vibe coding tool Emergent:\nAs always, I make no money, affiliate, etc. from sharing this tool. Emergent is currently my most fun vibe coding tool in 2026 AND it builds simple web + mobile apps.\nApp 1 - Daily Diary\nHere are the apps my 10-year old niece built!\nHer first app:\nDaily Diary with daily mood, music, and photos.\nTry it here! (password: chocolate)\nHere’s the exact prompt she started with:\nBuild an online diary where on each page I write about my thoughts and can attach photos. It should look like a 2-page diary, with a flip animation to go the next page. And write the day on the top of each page.\nGo ahead and copy/paste the prompt into your Emergent session.\nEmergent AI will ask follow-up questions to clarify your intent.\nAnswer if you can. You can always say “Not sure” if you’re not really sure what you want.\nOnce this initial version worked, she incrementally added another feature with one simple prompt (I helped with the last sentence Unsplash reference):\nbased on the selected emoji mood for the day, change that day’s page background to a relevant background image that matches the mood. Download a bunch of free images from Unsplash as your samples.\nThen, AI implemented her feature request. But she wasn’t happy yet with that version. She wanted way more emojis and backgrounds! Here’s her next small incremental prompt:\nadd all emojis for the mood tracker\nmake a password ‘chocolate’\nmake more backgrounds\nShe was pretty happy with this version and wanted to make things perfect with music for each mood!\nadd an instrumental music matching with the emoji mood\nadd more emoji moods like weather and stuff\nHOWEVER she ran into a bug here. Music wasn’t playing, no matter how many different moods she selected. Instead of trying to build another feature, she asked AI to fix the issue first:\nwe are currently unable to hear the music, please fix this minor error so we are able to hear the instrumental music\nEmergent AI finally fixed it! The only remaining problem - she didn’t like the music options… so I showed her Suno AI to make her own music :)\nApp 2 - Learn Japanese\nHer 2nd app is a Japanese language learning app.\nTry it here!\nHere’s the exact prompt she used:\nmake a language learning app, preferably japanese for now\nadd vocabulary words, the 3 alphabets, sentences, pronunciation. and voice chats\nGo ahead and copy/paste the prompt into your Emergent session.\nAgain, AI will ask follow-up questions to clarify your intent.\nAnswer if you can. You can always say “Not sure” if you’re not really sure what you want.\nShe hasn’t added more features yet to this app, as she was already happy with this initial version.\nAs your next step:\nGo ahead and try adding another small feature!\nOld Way vs New Way\nThe old way of learning programming - start with THEORY.\nBoring books and data structures.\nThe new way?\nExperiencing the JOY OF BUILDING first.\nStart with vibe coding.\nBuild and launch simple functional websites and apps.\nEnjoy the process of ideation, creation, and iteration.\nThen, you progressively learn foundational technical knowledge as you run into those problems:\nhow do I let users login? (Authentication & Security)\nhow do I store user data? (Database & Data Modeling)\nhow do I call other apps? (APIs & Integrations)\nhow do I share my app? (Hosting & Deployment)\nP.S. Need More Help? 👋\n1/ Free AI courses\n2/ Free AI prompts\n3/ Free AI automations\n4/ Free AI vibe coding\n5/ Ask me anything @ Friday livestream\n6/ Free private community for Women Building AI\n7/ I built Blotato to grow 1M+ followers in 1 year",
  "metadata": {
    "site": "Sabrina Ramonov"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:06:41.060149",
  "updated_at": "2026-01-24T09:06:41.060149"
}