{
  "id": "8d37eaa37bfaf0b9e0b8b003097fb674",
  "source_type": "article",
  "source_url": "https://nextjs.org/blog/next-16-1",
  "title": "Next.js 16.1",
  "author": "Luke Sandberg; Tim Neutkens",
  "publish_date": "2025-12-18T00:00:00",
  "raw_content": "---\ntitle: Next.js 16.1\nauthor: Luke Sandberg; Tim Neutkens\nurl: https://nextjs.org/blog/next-16-1\nhostname: nextjs.org\ndescription: Next.js 16.1 introduces Turbopack file system caching for development, a new bundle analyzer, and easier debugging in Node.js.\nsitename: Next.js 16.1\ndate: 2025-12-18\n---\nThursday, December 18th 2025\nNext.js 16.1\nPosted byNext.js 16.1 focuses on faster development workflows and improved stability, with major updates to Turbopack and tooling.\n- Turbopack File System Caching for\nnext dev\n(stable): Improved compile times fornext dev\nby default. - Next.js Bundle Analyzer (experimental): Optimize your code with our new interactive tool.\n- Easier debugging: Debug your Next.js app with\nnext dev --inspect\n. - Transitive external dependencies: Turbopack can automatically handle transitive external dependencies with no warnings.\nUpgrade Today\n# Use the automated upgrade CLI\nnpx @next/codemod@canary upgrade latest\n# ...or upgrade manually\nnpm install next@latest react@latest react-dom@latest\n# ...or start a new project\nnpx create-next-app@latest\nTurbopack File System Caching for next dev\nTurbopack file system caching for next dev\nis now stable and on by default. Compiler artifacts are stored on disk, leading to significantly faster compile times when restarting your development server, especially in large projects.\nFirst route compile time\n~10× faster\nCold\nCached\n~5× faster\nCold\nCached\nLarge internal Vercel app\n~14× faster\nCold\nCached\nInternal applications at Vercel have been dogfooding this for the past year. To learn more about how we built file system caching for Turbopack, watch Luke Sandberg's talk at Next.js Conf.\nFollowing this release, we'll be stabilizing file system caching for next build\n. See our documentation for more information, and share your feedback on the dedicated GitHub discussion.\nNext.js Bundle Analyzer (experimental)\nNext.js 16.1 includes a new experimental Bundle Analyzer that works with Turbopack. It makes it easier to optimize bundle sizes for both server and client code—helping improve Core Web Vitals, reduce lambda cold start times, and identify bloated dependencies.\nnext experimental-analyze\nRunning the command launches an interactive UI to inspect production bundles, identify large modules, and see why they're included.\nTry it yourself: Open the interactive Bundle Analyzer demo to explore the module graph.\nThe Bundle Analyzer is deeply integrated into Next.js, allowing you to:\n- Filter bundles by route\n- View the full import chain showing why a module is included\n- Trace imports across server-to-client component boundaries and dynamic imports\n- View CSS and other imported asset sizes\n- Switch between client and server views\nThe Bundle Analyzer is in early development and will be improved further in future releases. Share your feedback on the dedicated GitHub discussion.\nEasier Debugging with next dev --inspect\nYou can now enable the Node.js debugger by passing --inspect\nto next dev\n. Previously this required passing NODE_OPTIONS=--inspect\nand would attach the inspector to all processes spawned by Next.js instead of only to the process running your code.\nImproved Handling of serverExternalPackages\nNext.js allows you to keep dependencies unbundled using serverExternalPackages\n. Previously, this only worked reliably for direct dependencies. If you used a library that internally depends on something like sqlite\n, and needed to externalize sqlite\n, you'd have to add it to your own package.json\n—even though it's not your direct dependency. This workaround leaked internal implementation details, created maintenance burden, and could lead to impossible version conflicts when multiple packages required different versions of the same dependency.\nNext.js 16.1 fixes this for Turbopack, which now correctly resolves and externalizes transitive dependencies in serverExternalPackages\nwithout additional configuration.\nOther Updates\n- 20MB smaller installs: Next.js installs are about 20MB smaller thanks to simplifications in the Turbopack file system caching layer.\n- New\nnext upgrade\ncommand: A newnext upgrade\ncommand makes upgrading easier. Going forward, you can just run this to upgrade Next.js versions. - MCP\nget_routes\ntool: The Next.js DevTools MCP server now has aget_routes\ntool to get the full list of routes in your application. generateStaticParams\ntiming: Time spent ongenerateStaticParams\nis now logged as part of the timings shown for requests in development.- Build worker logging:\nnext build\n\"Collecting page data\" and \"Generating static pages\" now log the number of worker threads used. - Improved async import bundling: Turbopack has improved bundling of async imports in dev to reduce the number of chunks produced, avoiding certain pathological but real-world cases.\n- Relative source map paths: Turbopack now produces source maps with relative file paths for server-side code, improving compatibility with Node.js and other ecosystem tools.\nFeedback and Community\nShare your feedback and help shape the future of Next.js:\nContributors\nNext.js is the result of the combined work of over 3,700 individual developers. This release was brought to you by:\n- The Next.js team: Andrew, Hendrik, Janka, Jiachi, Jimmy, Jiwon, JJ, Josh, Jude, Sam, Sebastian, Sebbie, Wyatt, and Zack.\n- The Turbopack team: Benjamin, Luke, Niklas, Tim, Tobias, and Will.\n- The Next.js Docs team: Delba, Rich, Ismael, and Joseph.\nHuge thanks to @kdy1, @eps1lon, @SyMind, @bgw, @swarnava, @devjiwonchoi, @ztanner, @ijjk, @huozhi, @icyJoseph, @acdlite, @unstubbable, @gnoff, @gusfune, @lukesandberg, @sokra, @hayes, @shuding, @wyattjoh, @marjan-ahmed, @timneutkens, @ajstrongdev, @zigang93, @mischnic, @Nayeem-XTREME, @hamirmahal, @eli0shin, @tessamero, @gaojude, @jamesdaniels, @georgesfarah, @timeyoutakeit, @sequencerr, @Strernd, @lucasadrianof, @wbinnssmith, @hamidreza-nateghi, @jokokoloko, @dijonmusters, @H01001000, @xusd320, @lubieowoce, @KaziMahbuburRahman, @zhiyanzhaijie, @feedthejim, @that-one-arab, @JamBalaya56562, @shrink, @florianliebig, @allenzhou101, @benmerckx, @ymc9, @Marukome0743, @pyrytakala, @danpeleg4, @gaearon, @styfle, @jhuleatt, @muhammadsyaddad, @roelvan, and @SukkaW for helping!",
  "metadata": {
    "site": "Next.js 16.1"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:06:52.306462",
  "updated_at": "2026-01-24T09:06:52.306462"
}