{
  "id": "95c475fde4ad250a990b60f28787f9c3",
  "source_type": "article",
  "source_url": "https://blog.google/company-news/outreach-and-initiatives/google-org/sundance-institute-ai-education/",
  "title": "Building a community-led future for AI in film with Sundance Institute",
  "author": "Mira Lane",
  "publish_date": "2026-01-20T00:00:00",
  "raw_content": "---\ntitle: Building a community-led future for AI in film with Sundance Institute\nauthor: Mira Lane\nurl: https://blog.google/company-news/outreach-and-initiatives/google-org/sundance-institute-ai-education/\nhostname: blog.google\ndescription: A look at how Sundance Institute will build a community-led ecosystem for AI education and empowerment, to support creatives.\nsitename: Google\ndate: 2026-01-20\ntags: ['None', 'AI,Google.org']\n---\nBuilding a community-led future for AI in film with Sundance Institute\nThe future of filmmaking is being defined by a new kind of creative partnership: artists experimenting with AI, iterating, and bringing ambitious visions to life.\nFor the past year, Google has worked side-by-side with filmmakers to explore ways to advance and enhance artistic processes with generative AI. But we’ve also heard a clear message: for AI to truly empower, it must be community-driven leadership and supported by accessible education. Currently, the majority of media companies feel overwhelmed by the pace of AI change and only 25% of media companies are currently investing in training.\nTo help, Google.org is providing $2 million in funding to the Sundance Institute to build a community-led ecosystem for AI education and empowerment. The funding will help bridge the AI skills gap by training over 100,000 artists in foundational AI skills and democratize access to AI learning for filmmakers. This effort is a part of Google.org’s AI Opportunity Fund, an initiative that helps Americans develop essential AI skills by funding best-in-class workforce development and education organizations across critical segments of society.\nA trusted ecosystem for AI filmmaking education\nBy supporting Sundance Institute's AI training efforts, Google.org is enabling a community-led ecosystem that focuses on:\n- Building the storytelling hubs of the future: Sundance Institute will establish an AI Literacy Alliance initiative in collaboration with The Gotham and Film Independent. This initiative will empower artist communities by providing training and support of the establishment of values and ethics that protect human creativity, artists and the creative industry at-large.\n- Turning big ideas into technical skills: Sundance Institute and alliance partners will develop a free online curriculum to help bridge the gap between creative curiosity and effective technical use. This will include scholarships for Google courses like AI Essentials.\n- Advancing artist learning and developing standards: Sundance Institute will launch an AI Creators Fellowship for technical experimentation and host community conversations to develop shared case studies, reports and industry-led standards.\nA year of collaborative innovation\nFor the past year, we’ve invited filmmakers to our labs to co-create new tools and inform the technical requirements of our generative models based on the practical, rigorous standards of the filmmaking craft. Today’s announcement from Google.org is the natural evolution of our \"collaboration-first\" approach, building on recent initiatives such as:\n- Flow: Built with creatives, for creatives: We gave storytellers early access to Flow, our AI filmmaking tool. Their hands-on feedback helped us shape an interface that, today, serves as a place where artists can explore and iterate on cinematic ideas. Through our program Flow Sessions, we continue to work closely with a group of creatives — providing them with mentorship, AI education and unlimited access to the tool as they work to create short films of all types.\n- AI on Screen: In partnership with Range Media Partners, we launched this short film program to explore our evolving relationship with technology through the creation of films about AI, not made with AI. The program’s first film, Sweetwater, examines the poignant concept of digitally preserving a loved one’s memory.\n- Primordial Soup: Our partnership with Darren Aronofsky’s Primordial Soup on the film Ancestra forced our generative models to solve real-world production hurdles. To meet director Eliza McNitt’s vision, we developed advanced capabilities like personalized video for character consistency and motion matching to replicate complex 3D camera paths.\nToday’s independent filmmakers are at the center of a foundational shift. But tools do nothing on their own; it is human imagination that gives them purpose. The goal is no longer just to learn a new tool, but to realize the creative potential that AI unlocks for their specific vision. Across our ongoing collaborations and investment in community-led education, we are committed to ensuring that the future of film remains firmly in the hands of the storytellers.\nWe’re now heading to Park City, if you’re attending, come check out our deep dive session into Flow or the Sundance Institute Story Forum where we’ll preview “Dear Upstairs Neighbors,” demonstrating how custom Google DeepMind models help artists transform hand-crafted art into \"living paintings\" while maintaining total creative control.",
  "metadata": {
    "site": "Google"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:07:34.812377",
  "updated_at": "2026-01-24T09:07:34.812377"
}