{
  "id": "a23161f97785a21076ced53a89383e74",
  "source_type": "article",
  "source_url": "https://www.sabrina.dev/p/ces-2026-top-3-things-im-actually",
  "title": "CES 2026 Top 3 Things I'm Actually Excited About",
  "author": "Sabrina Ramonov",
  "publish_date": "2026-01-10T00:00:00",
  "raw_content": "---\ntitle: CES 2026 Top 3 Things I'm Actually Excited About\nauthor: Sabrina Ramonov\nurl: https://www.sabrina.dev/p/ces-2026-top-3-things-im-actually\nhostname: sabrina.dev\ndescription: Hi-tech future meets the low-tech reality...\nsitename: Sabrina Ramonov\ndate: 2026-01-10\n---\nCES 2026 - Top 3 Things I'm Actually Excited About\nHi-tech future meets the low-tech reality...\nI just returned from CES 2026 in Las Vegas, marketed as the “most powerful tech conference in the world”.\nAnd I won’t be back anytime soon.\nWhen you think of CES, you think of the absolute BEST TECH.\nYou expect to live in the future, surrounded by humanoids, drones, and self-driving cars.\nAnd while that stuff was definitely on display, the moment you stepped away from the booths, the “future” disappeared fast.\nBut first, I’ll share 3 things that did genuinely spark my interest from CES.\nAI Mattress\nI’m obsessed with sleep.\nFor the first 25 years of my life, I assumed bad sleep was normal.\nI had mild sleep apnea and didn’t know it.\nIn fact, I equated bad sleep with work ethic:\n“I’m hustling so hard, that’s why I don’t sleep well.”\nAfter I got my diagnosis, I went on a years-long quest to fix my sleep. I’m still on this quest. I’ve tried so many things: mandibular advancement devices, mouth tape, room blinds, eight sleep cooling pad, adjustable beds, taping a tennis shirt to my back, oura ring, hatch sleep light, different pillows, mobile app sleep trackers, multiple home sleep assessments, meditation, etc. Many in my family use CPAP machines, but I try to avoid it.\nAt one point, I tried mouth tape + blind fold + potato sack that simulates hugging, all at the same time…\nMy poor husband woke up to this:\nAt CES 2026, I was genuinely surprised by an AI mattress!\nIt makes realtime micro adjustments to the bed based on analyzing pressure to ensure the most comfortable spinal alignment. It’s like lying on a row of slats; each slat adjusts its position.\nIt keeps adjusting until you’re ultra relaxed, which it measures with sensors that detect your heart rate.\nI currently use Eight Sleep for temperature regulation but it’s NOT life changing. I don’t rave about it.\nBut with this AI mattress, I didn’t feel tired and I even drank coffee, yet I was ready to pass out after 5 minutes.\nIt’s possible I WAS physically tired from walking around, so I’d love to test drive this longer.\nHOWEVER:\nI have had this experience ONCE in my life when shopping for an ergonomic office chair. After testing 100+ chairs, I went with a particular model of Stressless recliners because my body relaxed within just a few minutes, to the point of napping. I’ve owned this recliner for 5 years… it is the BEST home office purchase I’ve ever made. No back strain, no neck strain, etc.\nAll this to say, I’m quite impressed by the AI mattress. It seems promising because it reminded me of my office chair experience. But I’d love to test-drive it longer! Sadly, I couldn’t find any REAL reviews of it from consumers… it’s that early.\nIf you want to learn why sleep is so important - ask ChatGPT! But if you want a book, this is good.\nAI Exoskeleton\nExoskeletons look futuristic but cumbersome.\nYet, they exceeded my expectations and, if more affordable, could truly help MILLIONS of people. No exaggeration.\nReal use cases:\nseniors\ndisabilities\nrehab from injury\nenjoying sports despite injury\nlong or steep hikes/bikes/walks/snowshoe\nHere’s a demo of an exoskeleton I tried at CES 2026.\nI definitely felt its added “support”. It was easy to use and felt natural after a few moments.\nDespite the heavy battery pack, the whole system did not feel heavy or obtrusive. You simply forget about it.\nHere’s a real take from endurance athlete Marc Payan:\nThought the hypershell.tech was a gimmick, but gave it try. Got their top end one $2K and have used it 5X now for multiple hours trail running, 6hr hike on one of the hardest day hikes in America, and other 2-3hr strenuous hikes.\nI liken it to efficiently using trekking poles to reduce load. It’s like ePoles. I felt the most support while mountain biking up steep terrain.\nIt doesn’t make you faster, but it does reduce the load impact. Funny thing is that while not using them I now think about using my quads & glutes more than I have ever before.\nWe’re getting 5 sets for volunteers surveying natural resources in hard to reach areas.\nMy only concern?\nThe exoskeleton kept trying to keep going even when I stopped walking. You can see this at the end of my video.\nBut if this tech continues to be improved, imagine if it could also help prevent injuries, falls, etc. These are massively important real-world use cases.\nIf you’d like to learn more about how exoskeletons use AI, this is a good intro read.\nAI Robot\nI’m curious about AI robots.\nBut I’m also terrified.\nHere’s my hubby fighting a humanoid Unitree robot at CES 2026:\nSome people watch that video and think “humans still win”.\nBut I had the opposite reaction.\nHere’s why AI robots scare me:\nimagine the 6 foot upgraded version - new Unitree H2, already way taller than I am\nmade of metal - hubby hurt his wrist punching the robot since he wasn’t wearing wraps underneath boxing gloves. He practices muay thai and jiu jitsu. If you tried to kick that robot, you’d instantly get shin splints.\nnever gets tired - punch it as hard as you want, it doesn’t slow down or fatigue; obviously it can run out of battery, but you will probably get tired long before it runs out.\ncoordinated with a fleet - multiple robots\nOn the consumer side:\nI still didn’t see any useful everyday use cases that would justify buying a humanoid robot in 2026.\nThere are specialized robots trained to just fold laundry, for example, but then they can’t do anything else…\nExpectations vs Reality\nLike I said, I won’t be back to CES anytime soon.\nHere are my thoughts on expectations vs reality.\nLet’s start with the basics: infrastructure.\nI spent all day at the Venetian on Wednesday.\nThere was no phone signal. I couldn’t get a text to send for hours, and the free wifi didn’t work. It’s 2026, we’re at a global tech/hardware/AI summit… and I’m struggling to send a text.\nThe irony was everywhere.\nI saw these awesome fancy toilets (I love my own Toto at home), but then you go into actual restrooms and it’s… 15 years old.\nAnd where are the self-driving shuttles or cars?\nCES has lots of cool lights and autonomous vehicle prototypes, but the actual transportation to and from the main venues? to and from hotels? Manual. We’re still sitting in traffic in human-driven cars while looking at ads for an autonomous future.\nThe lack of AI glasses really surprised me. Every other booth was selling AI smart glasses.\nBut here’s the thing: nobody was wearing them!\nSame for live translation tech.\nThis is a global event with people flying in from every corner of the world, speaking different languages. Yet, no one was using AI live translation tech.\nOverall, I’m glad I attended CES 2026.\nSeeing expectations vs reality play out in real-time is a helpful reframe for me as an AI educator. But I won’t be back anytime soon!\nP.S. Need More Help? 👋\n1/ Free AI courses\n2/ Free AI prompts\n3/ Free AI automations\n4/ Free AI vibe coding\n5/ Ask me anything @ Friday livestream\n6/ Free private community for Women Building AI\n7/ I built Blotato to grow 1M+ followers in 1 year",
  "metadata": {
    "site": "Sabrina Ramonov"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:06:40.922212",
  "updated_at": "2026-01-24T09:06:40.922212"
}