{
  "id": "b81148a12674bdc5c15f06d5f9056c16",
  "source_type": "article",
  "source_url": "https://techcrunch.com/2026/01/23/whos-behind-ami-labs-yann-lecuns-world-model-startup/",
  "title": "Who's behind AMI Labs, Yann LeCun's ‘world model’ startup | TechCrunch",
  "author": "Anna Heim",
  "publish_date": "2026-01-23T00:00:00",
  "raw_content": "---\ntitle: Who's behind AMI Labs, Yann LeCun's ‘world model’ startup | TechCrunch\nauthor: Anna Heim\nurl: https://techcrunch.com/2026/01/23/whos-behind-ami-labs-yann-lecuns-world-model-startup/\nhostname: techcrunch.com\ndescription: Yann LeCun's new venture, AMI Labs, has drawn intense attention since the AI scientist left Meta to found it.\nsitename: TechCrunch\ndate: 2026-01-23\ncategories: ['AI']\ntags: ['yann lecun,world models,ami labs']\n---\nYann LeCun’s new venture, AMI Labs, has drawn intense attention since the AI scientist left Meta to found it. This week, the startup finally confirmed what it’s building — and several key details have been hiding in plain sight.\nOn its newly launched website, the startup disclosed its plans to develop “world models” in order to “build intelligent systems that understand the real world.” The focus on world models was already hinted at by AMI’s name, which stands for Advanced Machine Intelligence, but it has now officially joined the ranks of the hottest AI research startups.\nBuilding foundational models that bridge AI and the real world has become one of the field’s most exciting pursuits, attracting top scientists and deep-pocketed investors alike — product or no product.\nWorld Labs, a direct rival founded by AI pioneer Fei-Fei Li, became a unicorn shortly after coming out of stealth. After launching its first product, Marble, which generates physically sound 3D worlds, World Labs is now reportedly in talks to raise fresh funding at a valuation of $5 billion.\nThere’s little doubt that VCs would be equally eager to invest in LeCun, adding credibility to rumors that AMI Labs might be raising funding at a $3.5 billion valuation. According to Bloomberg, VCs in talks with the startup include Cathay Innovation, Greycroft, and Hiro Capital, to which LeCun is an advisor. Other potential investors reportedly include 20VC, Bpifrance, Daphni, and HV Capital.\nRegardless of who writes the checks, investors may want to note an important detail: As LeCun has made clear, he is AMI’s executive chairman, not its CEO. Instead, that role belongs to Alex LeBrun, previously co-founder and CEO at Nabla, a health AI startup with offices in Paris and New York.\nLeBrun’s transition from Nabla to AMI is part of a partnership announced last December by Nabla, which develops AI assistants for clinical care and to which LeCun has been an advisor. In exchange for “privileged access” to AMI’s world models, Nabla’s board supported LeBrun’s shift from CEO to chief AI scientist and chairman, clearing the way for his new role.\nDisrupt 2026 Tickets: One-time offer\nTickets are live! Save up to $680 while these rates last, and be among the first 500 registrants to get 50% off your +1 pass. TechCrunch Disrupt brings top leaders from Google Cloud, Netflix, Microsoft, Box, a16z, Hugging Face, and more to 250+ sessions designed to fuel growth and sharpen your edge. Connect with hundreds of innovative startups and join curated networking that drives deals, insights, and inspiration.\nDisrupt 2026 Tickets: One-time offer\nTickets are live! Save up to $680 while these rates last, and be among the first 500 registrants to get 50% off your +1 pass. TechCrunch Disrupt brings top leaders from Google Cloud, Netflix, Microsoft, Box, a16z, Hugging Face, and more to 250+ sessions designed to fuel growth and sharpen your edge. Connect with hundreds of innovative startups and join curated networking that drives deals, insights, and inspiration.\nAs AMI Labs’ CEO, LeBrun will be surrounded by familiar faces. After Facebook acquired his previous startup, Wit.ai, the serial entrepreneur and AI engineer worked under LeCun’s leadership at Meta’s AI research laboratory, FAIR. According to reports, the duo will also be joined by Laurent Solly, who stepped down as Meta’s vice president for Europe last December.\nThe talent overlap between AMI and Meta likely won’t stop there. LeCun told the MIT Technology Review that his former employer could well be AMI’s first client. But he has also been publicly critical of some of Meta’s strategic choices made under Mark Zuckerberg’s direction. More broadly, the Review interprets AMI Labs as a contrarian bet against large language models (LLMs).\nThe limitations of LLMs that LeCun has pointed out include hallucinations, which are a serious concern in contexts like medicine, as LeBrun also knows firsthand. AMI Labs’ CEO told Forbes that a big reason he took the role was the prospect of applying its world models to healthcare. But the startup will also target other high-stakes applied fields.\n“AMI Labs will advance AI research and develop applications where reliability, controllability, and safety really matter, especially for industrial process control, automation, wearable devices, robotics, healthcare, and beyond,” it wrote in its mission statement. “We share one belief: real intelligence does not start in language. It starts in the world.”\nUnlike generative approaches, which LeCun and his team see as poorly suited for unpredictable data such as sensor input, the startup promises that its AI systems will not only understand the real world, but also have persistent memory, the ability to reason and plan, and be controllable and safe.\nThe startup plans to license its technology to industry partners for real-life applications, but says it also plans to contribute to building the future of AI “with the global academic research community via open publications and open source.” LeCun said he plans to keep his professor position at NYU, where he teaches one class per year and supervises PhD and postdoctoral students.\nThis means that the French-born researcher will remain based in New York, but he told the MIT Technology Review that AMI Labs “is going to be a global company [that’s] headquartered in Paris.” The news was welcomed by French President Emmanuel Macron, who expressed his pride that LeCun, who is also a Turing Prize winner, chose Paris. “We will do everything we can to ensure his success from France,” he said.\nThe startup will also have offices in Montreal, New York, and Singapore, but its decision to pick Paris for its headquarters will help consolidate Paris’ reputation as an AI hub, where it will join the ranks of H, Mistral AI and several international labs, including FAIR. It’s fitting, perhaps, that AMI is pronounced a-mee — like “ami” in French, which means “friend,” LeCun has pointed out.",
  "metadata": {
    "site": "TechCrunch"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:07:33.310872",
  "updated_at": "2026-01-24T09:07:33.310872"
}