{
  "id": "e1b9cdb90db657932e282667407962f6",
  "source_type": "article",
  "source_url": "https://www.sabrina.dev/p/if-you-want-2026-to-be-the-best-year",
  "title": "If you want 2026 to be the best year of your life, use my AI Co-Founder MEGA Prompt",
  "author": "Sabrina Ramonov",
  "publish_date": "2026-01-17T00:00:00",
  "raw_content": "---\ntitle: If you want 2026 to be the best year of your life, use my AI Co-Founder MEGA Prompt\nauthor: Sabrina Ramonov\nurl: https://www.sabrina.dev/p/if-you-want-2026-to-be-the-best-year\nhostname: sabrina.dev\ndescription: How to use my \"AI Co-Founder MEGA Prompt\" to stop doing too much and start achieving your goals.\nsitename: Sabrina Ramonov\ndate: 2026-01-17\n---\nIf you want 2026 to be the best year of your life, use my AI Co-Founder MEGA Prompt\nHow to use my \"AI Co-Founder MEGA Prompt\" to stop doing too much and start achieving your goals.\nA few announcements:\nI’m ramping up to 5 youtube tutorials per week, so make sure you’re subscribed to my channel to get them\n[TUTORIAL] How to use Claude in Chrome to get work done\n[EVENT 1/23] Build Million Dollar Apps Q&A (apply to join my free Women Build AI community)\nMost entrepreneurs fail because they’re doing too much.\nYou enter the new year with 10 different goals.\nLaunch a podcast, start paid ads, post 3 times per day, hire a team, and vibe code 4 products… all at once.\nBut in the pursuit of ALL, you end up with NOTHING!\nWhat if you could hire a top 0.1% co-founder to be honest with you? Look at your massive to-do list and delete 99% of it?\nI recently spent a 4-hour flight doing exactly this.\nBut I didn’t hire an expensive consultant or advisor.\nI used a specific prompt on 3 different LLMs:\nGemini, ChatGPT, and DeepSeek.\nThen I sparred with each one.\nBy the time I landed, I had deleted 237 tasks and got clarity on the exact 3 levers that will multiply my growth.\nIn this tutorial, I’m going to give you my AI Co-Founder Prompt.\nBecause a real co-founder doesn’t add work.\nThey subtract it.\nThey find the few things that move the needle and scream at you to stop doing everything else.\nTo get this result, we need to feed the beast!\nWe are going to use a massive prompt that forces AI to:\nAnalyze your hard numbers\nIdentify your distractions\nAsk YOU questions until it determines your top 3 highest-leverage priorities\nWatch my Youtube for the step-by-step tutorial:\nTo support my free AI education: HIT LIKE + LEAVE A COMMENT🙏\nPrompt - Step by Step Breakdown\nFirst, let’s break this mega prompt down into sections so you understand why it works.\nPart 1: Role\nYou are a top 0.1% tech founder of a multi-billion dollar rocket ship startup. (Note: Change “tech founder” to match yourindustry, e.g. “Real Estate” or “E-commerce Expert”).\nPart 2: Context\nHere is the context on my business:\nProduct: [Explain what you sell]\nCustomers: [Who is your highest retention user group?]\nGoal: [What is your revenue or growth goal for 2026?]\nVision: [Where do you want the company to be in 5 years?]\nPart 3: Data\nDon’t lie to your AI co-founder. Input your real numbers.\nHere are my metrics:\nRevenue: [Insert 2025 Revenue]\nChurn: [Insert Churn Rate]\nFunnel: [Visitor -> Lead -> Sale conversion rates]\nExpenses: [Major cost categories]\nPart 4: Activities\nThis is where you dump everything you’ve been doing in 2025 and everything you think you should do in 2026. I literally copy-pasted my massive TODO list from google doc into the prompt.\nWhat worked in 2025:\n[List marketing activities that drove actual ROI]\nWhat you’re considering for 2026:\n[Dump your entire overwhelming to-do list here]\nPrompt - Full Example\nHere’s an example of the prompt filled out.\nThe numbers are fictional fyi :)\nYou are a top 0.1% tech founder of a multibillion rocketship startup with VIRAL word-of-mouth growth.\n# CONTEXT\nHere's my product: www.blotato.com\nHighest retention user group: Faceless video makers\nIn 2026, I want to significantly improve my web app to attract non-technical users who want to make 1 week of content in 1 minute\nMy vision: Capcut (instantly make carousels/videos) + Buffer (automate social media scheduling)\nHere are my revenue & churn metrics:\nCurrent MRR: $14,500\nMonthly Churn Rate: 7.2% (Too high, I know)\nARPU (Average Revenue Per User): $35\nHere is my funnel:\n700k website views in 2025\nIn the month of November 2025:\n145,000 website visitors\n2,175 new trial signups (1.5% visitor-to-trial conversion)\n87 new paid customers (4% trial-to-paid conversion)\n+$3,045 Net New MRR growth\n-$1,900 Churned Revenue\nHere’s my expenses in the month of December 2025:\n$4,000 salary (just me)\n$5,300 affiliate partners (payouts)\n$2,500 development fees (contractors/hosting)\n$600 stripe processor fees\n$1,200 marketing (tools & small experiments)\n$800 other tools (hosting, domains, AI API costs)\nMy current 2025 marketing channels:\n- My personal brand with XX+ million followers across social media\n- Youtube tutorials with content workflow automation templates\nMarketing activities I’m considering for 2026:\n- A/B test website to improve conversion rate from website visitors to new trial signups\n- Short-form influencer marketing (Tiktok / Reels), focused on showing my app's visual generator that lets users create 1 week of content in 1 minute\n- Similar to what I did for n8n, create Make tutorials on Youtube\n- Similar to what I did for n8n, create Zapier tutorials on Youtube\n- Use Claude Code to build automated AI SEO agent, based on my help docs\n- Facebook ads to retarget past signups\n- Newsletter ad sponsorships\n# TASK\nYour task is to identify the TOP 3 MOST IMPORTANT things I should focus on, in order to reach $50,000 monthly recurring revenue by the end of 2026.\nThere’s always a million things I could be doing, but I need to know the 3 most important things that will multiply my current monthly revenue.\nAsk me clarifying questions, one at a time, until you are 95% confident in your answer.\nThe last line is key:\n“\nAsk me clarifying questions, one at a time, until you are 95% confident in your answer.”\nAI will roast you with questions.\nAt any given point, ask it to reveal its confidence score!\nOn my 4-hour flight, I was running SQL queries to uncover data points that AI insisted I must have to make good decisions.\nAnd it was 100% worth it.\nThe more data and effort you put into this mega prompt, the more you will get out of it.\nThis exercise is no joke; it seriously helped me gain clarity, eliminate most TODOs, and feel confident in my 2026 plan.\nPrompt - Empty Template\nHere’s the clean version you can copy-paste and fill in with your information.\nIf you’ve previously shared this information with AI, just ask it to search its memories. Make sure your data is accurate.\nObviously, tweak the prompt for your business and use case. This was tailored for my product-led growth SaaS startup where I don’t have sales touch points, I have recurring monthly revenue, and I currently don’t run ads, etc.\nYou are a top 0.1% <INSERT> founder of a multibillion rocketship startup with VIRAL word-of-mouth growth.\n# CONTEXT\nHere's my product: <INSERT>\nHighest retention user group: <INSERT>\nIn 2026, I want to: <INSERT>\nMy vision: <INSERT>\nHere are my revenue & churn metrics:\n<INSERT>\nHere is my funnel:\nXX website views in 2025\nIn the month of December 2025:\n- XX website visitors\n- XX new trial signups\n- XX trial conversion rate\n- XX net new MRR growth\n- XX churned revenue\nHere’s my expenses in the month of December 2025:\n$XXk salary\n$XXk affiliate partners\n$XXk development fees\n$XXk stripe processor fees\n$XXk marketing\n$XXk other tools\nMy current 2025 marketing channels:\n-\n-\n-\nMarketing activities I’m considering for 2026:\n-\n-\n-\n# TASK\nYour task is to identify the TOP 3 MOST IMPORTANT things I should focus on, in order to reach <INSERT> monthly recurring revenue by the end of 2026.\nThere’s always a million things I could be doing, but I need to know the 3 most important things that will multiply my current monthly revenue.\nAsk me clarifying questions, one at a time, until you are 95% confident in your answer.\nNext Level - Mixture of Experts\nThis is an optional ADVANCED step.\nBut I frickin’ love it!\nIt’s basically “mixture of experts” where you run the same prompt across multiple AI tools and triangulate their feedback.\nHere, I’m using Gemini x ChatGPT 5.2 x DeepSeek:\nReal fast, you’ll notice each AI tool’s questions will diverge and go down different rabbit holes.\nYou’ll be interrogated by multiple AI tools from multiple angles, which forces you to clarify your thinking, get smarter, and dig into more data.\nYou can play them off each other too!\nCopy paste Gemini’s answer and ask DeepSeek what it thinks :)\nIt’s hard to go back once you start using AI this way.\nPLEASE let me know your RESULTS in the COMMENTS!\nWould love to hear from you.\nP.S. Need More Help? 👋\n1/ Free AI courses\n2/ Free AI prompts\n3/ Free AI automations\n4/ Free AI vibe coding\n5/ Ask me anything @ Friday livestream\n6/ Free private community for Women Building AI\n7/ I built Blotato to grow 1M+ followers in 1 year",
  "metadata": {
    "site": "Sabrina Ramonov"
  },
  "status": "ingested",
  "blog_content": null,
  "social_content": null,
  "google_doc_id": null,
  "error_message": null,
  "created_at": "2026-01-24T09:06:40.458237",
  "updated_at": "2026-01-24T09:06:40.458237"
}